<a href="https://colab.research.google.com/github/ephantusGachomba/Hello_world/blob/master/Copy_of_Pandas_Basics.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

<font color="green">*To start working on this notebook, or any other notebook that we will use in the Moringa Data Science Course, we will need to save our own copy of it. We can do this by clicking File > Save a Copy in Drive. We will then be able to make edits to our own copy of this notebook.*</font>

# Pandas Basics

## 1.0 Importing Pandas Library

In [ ]:
# Let's import the pandas library just like we did with Numpy
# 
import pandas as pd

## 1.1 Performing Basic Operations

In [ ]:
# Example 1
# Pandas is built on the NUmpy package.
# It's main data structure is called DataFrame. Dataframes allows us to store and manipulate data in row and column observations


# In this section, we will cover some of the basic operations 
# that we perform while using pandas.
# The first thing we will do is to create a Dataframe from a dictionary as shown below;
# Think of a Dataframe as a table. By definition, a DataFrame is a 2-dimensional labeled data structure 
# with columns of potentially different types.
# 
data = [{'name': 'vikash', 'age': 27}, {'name': 'Satyam', 'age': 14}]
df = pd.DataFrame.from_dict(data, orient='columns')
df

# Something to note in the results is that everytime you create a dataframe it will automatically assign indexes to the row.

     name  age
0  vikash   27
1  Satyam   14

In [ ]:
# Example 2
# We can also create a Dataframe by inserting rows iteratively
# 

# For this example, we will use the randint() function 
# thus we will need to import it
from random import randint

# We will also need to declare the columns that we will need 
columns = ['a', 'b', 'c']

# Then creating our dataframe
df = pd.DataFrame(columns=columns)

# lastly append random values to the dataframe iteratively using a for loop.
# We are going to use two for loops. the first one will be for the number of rows and the second one will be for the number of columns.
# In the outer loop, we will create a range of number from 0-5, then iterate through it. This means that we will have 6 rows
# We'll explain the logic of this code from the inside out. 
# So inside the inner loop, we  aim to populate our dataframe with random integers that are between -1 and 1.
# Hence everytime we generate out random number, we use pandas dataframe method called loc[] to insert the random number in either of the three columns
# The .loc method works in the same way slicing works in python list. This means that it can be used to access elements inside a dataframe. As such, we can also use it to update elements in a dataframe.
# When we created the  empty dataframe earlier, it meant that the elements were null. So in our code we are simply updating the null elements with values.
# The logic for this code can be alittle bit confusing at first, so spend a little bit of time with your pair trying understand how the code works as it will help you alot in the future.
for i in range(7): #6 rows
    for c in columns:
      df.loc[i,c] = randint(-1,1)
  
# and printing out the dataframe
df

    a   b   c
0  -1  -1   1
1   1   0  -1
2  -1  -1   1
3  -1   0  -1
4   1  -1   0
5   0   1  -1
6  -1  -1   1

In [ ]:
 # Example 3
# Creating a Dataframe with randomly generated data
# 

# We will import and use numpy in this example
import numpy as np

np_mat = np.random.randint(0,5,size=(5, 4))

np_mat

# Uncomment the following lines after running the previous lines 
#df = pd.DataFrame(np_mat, columns=list('ABCD'))
# df

array([[2, 0, 3, 0],
       [0, 2, 2, 3],
       [3, 3, 3, 4],
       [2, 4, 4, 2],
       [0, 1, 0, 3]])

In [ ]:
df = pd.DataFrame(np_mat, columns=list('ABCD'))
df

   A  B  C  D
0  2  0  3  0
1  0  2  2  3
2  3  3  3  4
3  2  4  4  2
4  0  1  0  3

In [ ]:
# Example 4
# Creating a Dataframe from a csv file 
# 
df = pd.read_csv('sample_data/california_housing_test.csv', delimiter = ',')
df

# Uncomment the following lines after running the previous lines
df_url = "https://raw.githubusercontent.com/cs109/2014_data/master/countries.csv"
df = pd.read_csv(df_url)
df

       Country         Region
0      Algeria         AFRICA
1       Angola         AFRICA
2        Benin         AFRICA
3     Botswana         AFRICA
4      Burkina         AFRICA
..         ...            ...
189   Paraguay  SOUTH AMERICA
190       Peru  SOUTH AMERICA
191   Suriname  SOUTH AMERICA
192    Uruguay  SOUTH AMERICA
193  Venezuela  SOUTH AMERICA

[194 rows x 2 columns]

In [ ]:
# Example 5
# Changing Dataframe column names 
# 
df_list = [['AA', 1, 'a'],['BB', 2, 'a'],['CC', 3, 'a']]

df = pd.DataFrame(df_list, columns = ['name','value','salue'])
df

# Uncomment the following lines after running this cell once
# df.columns.values[1:] = ['prefix_' + val for val in df.columns.values[1:]]
# df.columns.values
# df

  name  value salue
0   AA      1     a
1   BB      2     a
2   CC      3     a

In [ ]:
# Example 6
# A simpler way of changing Dataframe column names 
#
df_list = [['AA', "temp", 1],['BB', "temp", 2],['CC', "temp", 3]]
df = pd.DataFrame(df_list, columns = ['name','temp', 'value'])
df

# Uncomment the following line
df.columns = ['names', 'temperature', 'values']
df

  names temperature  values
0    AA        temp       1
1    BB        temp       2
2    CC        temp       3

In [ ]:
# Example 7
# Choosing specific columns from a DataFrame
# 
df_list = [['AA', "temp", 1],['BB', "temp", 2],['CC', "temp", 3]]
df = pd.DataFrame(df_list, columns = ['name','temp', 'value'])
df

# Uncomment the following lines after running 
df = df[["name","temp"]]
df

  name  temp
0   AA  temp
1   BB  temp
2   CC  temp

In [ ]:
# Example 8
# Deleting/dropping columns or extracting columns from Dataframe 
# 
df_list = [['AA', "temp", 1],['BB', "temp", 2],['CC', "temp", 3]]
df = pd.DataFrame(df_list, columns = ['name','value','temp'])
df

# Uncomment the following lines
df.drop('value', axis=1, inplace=True)
df

# Uncomment the following lines after running the previous commented lines
df = pd.DataFrame([['AA', 1],['BB', 2],['CC', 3]], columns = ['name','value'])
df

#Uncomment the following lines after running the previous commented lines
values = df.pop('value')
df

# Uncomment the line below after running the previous commented lines
values

0    1
1    2
2    3
Name: value, dtype: int64

### <font color="green">1.1 Challenges</font>

In [ ]:
# Challenge 1
# Create a Dataframe from the following dictionary 
# 
studentData = {
    'name' : ['jack', 'Riti', 'Aadi'],
    'age' : [34, 30, 16],
    'city' : ['Sydney', 'Delhi', 'New york']
}

#OUR CODE GOES HERE
df = pd.DataFrame.from_dict(studentData , orient= 'columns')
df

   name  age      city
0  jack   34    Sydney
1  Riti   30     Delhi
2  Aadi   16  New york

In [ ]:
# Challenge 2
# Create the Dataframe shown below in the Expected Output by inserting rows iteratively
# OUR CODE GOES HERE
from random import randint
column_names = list('xyz')

df1 = pd.DataFrame(columns=column_names)
for r in range(4):
  for col in column_names:
    df1.loc[r,col] = randint(1,3)

df1

   x  y  z
0  2  3  2
1  2  3  3
2  2  1  3
3  2  2  1

In [ ]:
# Challenge 2: Expected Output
# [Do not run this cell]
# Running this cell will clear the output

   x  y  z
0  1  3  3
1  2  1  2
2  3  2  1
3  3  2  3

In [ ]:
# Challenge 3
# Create the Dataframe shown in the Expected Output below with randomly generated integers
# OUR CODE GOES HERE
from random import randint
column_names2 = ['A' , 'B' , 'C' , 'D']
df2 = pd.DataFrame(columns=column_names2)

for r in range(10):
  for col in column_names2:
    df2.loc[r,col] = randint(0,9)

df2

   A  B  C  D
0  6  2  6  3
1  3  9  8  3
2  5  3  0  4
3  7  3  2  1
4  3  1  4  9
5  1  1  1  6
6  1  8  1  3
7  6  4  5  1
8  9  1  2  0
9  6  3  2  9

In [ ]:
# Challenge 3: Expected Output
# Running this cell will clear the output
# Attention: Do not run this cell!

   A  B  C  D
0  8  2  8  0
1  6  6  0  8
2  2  2  0  4
3  8  2  7  2
4  7  5  9  3
5  7  9  8  6
6  6  0  8  9
7  3  1  7  0
8  8  7  7  0
9  9  3  6  7

In [ ]:
# Challenge 4
# Create a Dataframe from the mnist_test csv file in the sample_data directory
#OUR CODE GOES HERE
import pandas as pd
df_mnist_test = pd.read_csv('/content/sample_data/mnist_test.csv' , delimiter=',')
df_mnist_test.head(3)

   7  0  0.1  0.2  0.3  0.4  ...  0.662  0.663  0.664  0.665  0.666  0.667
0  2  0    0    0    0    0  ...      0      0      0      0      0      0
1  1  0    0    0    0    0  ...      0      0      0      0      0      0
2  0  0    0    0    0    0  ...      0      0      0      0      0      0

[3 rows x 785 columns]

In [ ]:
# Challenge 5
# Create a Dataframe from dataset with the following url source
# URL: http://bit.ly/NairobiBusesDataset
#OUR CODE GOES HERE

df_url = "http://bit.ly/NairobiBusesDataset"
df_NairobiBusesDataset = pd.read_csv(df_url)
df_NairobiBusesDataset

       ride_id seat_number payment_method  ... travel_to car_type max_capacity
0         1442         15A          Mpesa  ...   Nairobi      Bus           49
1         5437         14A          Mpesa  ...   Nairobi      Bus           49
2         5710          8B          Mpesa  ...   Nairobi      Bus           49
3         5777         19A          Mpesa  ...   Nairobi      Bus           49
4         5778         11A          Mpesa  ...   Nairobi      Bus           49
...        ...         ...            ...  ...       ...      ...          ...
51640    13826          9B          Mpesa  ...   Nairobi      Bus           49
51641    13809         18A          Mpesa  ...   Nairobi      Bus           49
51642    13809         17A          Mpesa  ...   Nairobi      Bus           49
51643    13796         16B          Mpesa  ...   Nairobi      Bus           49
51644    14304           7          Mpesa  ...   Nairobi      Bus           49

[51645 rows x 10 columns]

In [ ]:
# Challenge 6
# Change the column names of the dataset from this source (http://bit.ly/FiveYearData) 
# to: country, year, population, continent, life_exp, gdp_per_cap
#OUR CODE GOES HERE

import pandas as pd
df_url = "http://bit.ly/FiveYearData"
df_FiveYearData = pd.read_csv(df_url)
df_FiveYearData.head()

       country  year         pop continent  lifeExp   gdpPercap
0  Afghanistan  1952   8425333.0      Asia   28.801  779.445314
1  Afghanistan  1957   9240934.0      Asia   30.332  820.853030
2  Afghanistan  1962  10267083.0      Asia   31.997  853.100710
3  Afghanistan  1967  11537966.0      Asia   34.020  836.197138
4  Afghanistan  1972  13079460.0      Asia   36.088  739.981106

In [ ]:
df_FiveYearData.columns = ['country' , 'year' , 'population' , 'continent' , 'life_exp' , 'gdb_per_cap']
df_FiveYearData.head()

       country  year  population continent  life_exp  gdb_per_cap
0  Afghanistan  1952   8425333.0      Asia    28.801   779.445314
1  Afghanistan  1957   9240934.0      Asia    30.332   820.853030
2  Afghanistan  1962  10267083.0      Asia    31.997   853.100710
3  Afghanistan  1967  11537966.0      Asia    34.020   836.197138
4  Afghanistan  1972  13079460.0      Asia    36.088   739.981106

In [ ]:
#changing column name for a single column name
#df_FiveYearData.columns.values[0:1] = ['countries']
#df_FiveYearData.head()

In [ ]:
# Challenge 7
# Choose the country, year and continent columns from a DataFrame in challenge 6
#OUR CODE GOES HERE
df_FiveYearData[['country' , 'year' , 'continent']].head(4)

       country  year continent
0  Afghanistan  1952      Asia
1  Afghanistan  1957      Asia
2  Afghanistan  1962      Asia
3  Afghanistan  1967      Asia

In [ ]:
# Challenge 8
# Drop the population and life_exp columns from the DataFrame in challenge 6
#OUR CODE GOES HERE
df_FiveYearData.drop(['population' , 'life_exp'] , axis = 1 , inplace=True)
df_FiveYearData

          country  year continent  gdb_per_cap
0     Afghanistan  1952      Asia   779.445314
1     Afghanistan  1957      Asia   820.853030
2     Afghanistan  1962      Asia   853.100710
3     Afghanistan  1967      Asia   836.197138
4     Afghanistan  1972      Asia   739.981106
...           ...   ...       ...          ...
1699     Zimbabwe  1987    Africa   706.157306
1700     Zimbabwe  1992    Africa   693.420786
1701     Zimbabwe  1997    Africa   792.449960
1702     Zimbabwe  2002    Africa   672.038623
1703     Zimbabwe  2007    Africa   469.709298

[1704 rows x 4 columns]

## 1.2 Manipulating Dataframes

In [ ]:
# Example 1
# While working with dataframes, sometimes we may want to iterate over our dataframe and do sopme operations on each row. 
#Pandas gives us two methods to enable us to do this.
# We are going to look at them in the following example.
# 

df = pd.DataFrame([['AA', 1],['BB', 2],['CC', 3]], columns = ['name','value'])
df

# Uncomment after running previous lines
# Since we are iterating over rows, we are going to use a pandas method called iterrows(). 
#This method returns an iterator that contains indices of each row and data on each row. Each row is stored in a Series
for index, row in df.iterrows():
  print(row['name'], row['value'])


# Uncomment after runnuni previous lines
# The other method we that is available to us is itertuples() method. This method loops through each row and returns a named tuple.
for row in df.itertuples():  
  print(row)

AA 1
BB 2
CC 3
Pandas(Index=0, name='AA', value=1)
Pandas(Index=1, name='BB', value=2)
Pandas(Index=2, name='CC', value=3)

In [ ]:
# Example 2
# Applying a function to Dataframe row
# This is useful when cleaning up data - converting formats, altering values etc.
# In this example we are going to create a third column then create a function that concatenates the values of the first and second column.
df = pd.DataFrame([['AA', 1],['BB', 2],['CC', 3]], columns = ['name','value'])
df

# Uncomment after running previous lines

# Define a function that takes in two values and returns the two values concatenated together
def function_1(val_1, val_2):

   # before retuning the values, we convert the first values into a string because values in one column are strings
  return val_1 + str(val_2)

# Create a third column called col_a then apply a function that we defined above using python lambda.
# Since lambda is a new concept, take a few minutes to read about it here: https://www.afternerd.com/blog/python-lambdas/ . Its not a difficult concept to grasp, so it should not take alot of time to understand.
df['col_a'] = df.apply(lambda row: function_1(row['name'], row['value']), axis=1)
df

# Uncomment after running previous lines
# We create a new function that takes in a row value and multiplies it by 2
def function_2(val1):
  return val1 * 2
df['col_m'] = df.apply(lambda row : function_2(row['value']), axis=1)
df
# Create another column called col_b, that applies the above function and populates the column with our new values
# df['col_b'] = df.apply(lambda row: function_2(row), axis=1)
# df

  name  value col_a  col_m
0   AA      1   AA1      2
1   BB      2   BB2      4
2   CC      3   CC3      6

In [ ]:
# Example 3
# Applying a function to a specific column of Dataframe
# 
df = pd.DataFrame([['AA', 1], ['BB', 2], ['CC', 3]], columns=['name', 'value'])
df

# Uncomment after running previous lines
def function_1(val_1):
  return "prefix_" + str(val_1)
  
# Uncomment after running previous lines
# To be able to apply a function to the elements of the name column, we use the map function. 
#This function allows us to apply a specific function to all the elements of the targeted column.
df['name'] = df['name'].map(function_1)
df

        name  value
0  prefix_AA      1
1  prefix_BB      2
2  prefix_CC      3

In [ ]:
# Example 4
# Finding and replacing a value in Dataframe
# 
df = pd.DataFrame([['One', 'Two'], ['Four', 'Abcd'], ['One', 'Bcd'], ['Five', 'Cd']], columns=['A', 'B'])
df

# Uncomment after running previous lines
df.loc[df['A'] == 'One', 'A'] = 0
df

      A     B
0     0   Two
1  Four  Abcd
2     0   Bcd
3  Five    Cd

In [ ]:
df.loc[df['B']=='Two' , 'B']

0    Two
Name: B, dtype: object

### <font color="green">1.2 Challenges</font>

In [ ]:
# Challenge 1
# Create a Dataframe from the Dictionary below and iterate over the rows
graduates = {'name':["Jane Njoroge", "June Adhiambo", "Kevin Swale", "Heidi Sang"], 
        'degree': ["MBA", "BCA", "M.Tech", "MBA"], 
        'score':[90, 40, 80, 98]} 

#OUR CODE GOES HERE
df_graduates = pd.DataFrame.from_dict(graduates , orient='columns')
df_graduates

            name  degree  score
0   Jane Njoroge     MBA     90
1  June Adhiambo     BCA     40
2    Kevin Swale  M.Tech     80
3     Heidi Sang     MBA     98

In [ ]:
for index , row in df_graduates.iterrows():
  print(row['name'] , row['degree'] , row['score'] )

Jane Njoroge MBA 90
June Adhiambo BCA 40
Kevin Swale M.Tech 80
Heidi Sang MBA 98

In [ ]:
for row in df_graduates.itertuples():
  print(row)

Pandas(Index=0, name='Jane Njoroge', degree='MBA', score=90)
Pandas(Index=1, name='June Adhiambo', degree='BCA', score=40)
Pandas(Index=2, name='Kevin Swale', degree='M.Tech', score=80)
Pandas(Index=3, name='Heidi Sang', degree='MBA', score=98)

In [ ]:
# Challenge 2
# Apply the given function to SAL-RATE column
# http://bit.ly/EmployeeSalary

df_url_EmployeeSalary = "http://bit.ly/EmployeeSalary"
df_EmployeeSalary = pd.read_csv(df_url_EmployeeSalary)
#OUR CODE GOES HERE
df_EmployeeSalary.head(5)

   DPT             NAME      ... PC         SAL-RATE
0       868  B J  SANDIFORD  ...        X      $5.00
1       868    C A  WIGFALL  ...        X      $5.00
2        69  A E A-AWOSOGBA  ...        A  $51955.00
3       868        K D AABY  ...        X     $12.00
4        56       I D AADIL  ...        A  $46953.00

[5 rows x 6 columns]

In [ ]:
# Get rid of $ and , in the SAL-RATE, then convert it to a float
def money_to_float(money_str):
    return float(money_str.replace("$","").replace(",",""))

df_EmployeeSalary['SAL-RATE'] =  df_EmployeeSalary['SAL-RATE'].map(money_to_float)
df_EmployeeSalary.head(5)

   DPT             NAME      ... PC       SAL-RATE
0       868  B J  SANDIFORD  ...        X      5.0
1       868    C A  WIGFALL  ...        X      5.0
2        69  A E A-AWOSOGBA  ...        A  51955.0
3       868        K D AABY  ...        X     12.0
4        56       I D AADIL  ...        A  46953.0

[5 rows x 6 columns]

In [ ]:
# Challenge 3
# Replace the value in M.Tech in Challenge 1 Dataframe with Msc.Tech
# OUR CODE GOES HERE
df_graduates

            name  degree  score
0   Jane Njoroge     MBA     90
1  June Adhiambo     BCA     40
2    Kevin Swale  M.Tech     80
3     Heidi Sang     MBA     98

In [ ]:
df_graduates.loc[df_graduates['degree']=='M.Tech' , 'degree'] = 'Msc.Tech'
df_graduates

            name    degree  score
0   Jane Njoroge       MBA     90
1  June Adhiambo       BCA     40
2    Kevin Swale  Msc.Tech     80
3     Heidi Sang       MBA     98

## 1.3 Splitting and Merging Dataframes

In [ ]:
# Example 1
# Merging Dataframes by columns using join
# Create the first dataframe
df = pd.DataFrame([[1, 3], [2, 4]], columns=['A', 'B'])
df

# Uncomment and run after running previous lines
# Create the second dataframe
df2 = pd.DataFrame([[1, 5], [1, 6]], columns=['A', 'C'])
df2

# Uncomment and run after running previous lines
df.merge(df2, how='left', on='A')  # merges on columns A

# Uncomment and run after running previous lines
#df2.drop_duplicates(subset=['A'], inplace=True)

# Uncomment and run after running previous lines
# df.merge(df2, how='left', on='A')

In [ ]:
# Example 2
# Merging Dataframes by columns on index
# 
df = pd.DataFrame([[1, 3], [2, 4]], columns=['A', 'B'])
df

# Uncomment and run after running previous lines
# df2 = pd.DataFrame([[1, 5], [1, 6]], columns=['A', 'D'])
# df2

# Uncomment and run after running previous lines
# pd.concat([df, df2], axis=1)

   A  B
0  1  3
1  2  4

In [ ]:
df2 = pd.DataFrame([[1, 5], [1, 6]], columns=['A', 'D'])
df2

   A  D
0  1  5
1  1  6

In [ ]:
pd.concat([df, df2], axis=1)

   A  B  A  D
0  1  3  1  5
1  2  4  1  6

In [ ]:
# Example 3
# Merging Dataframes and splitting again 
# 
ts1 = [1,2,3,4]
ts2 = [6,7,8,9]
d = {'col_1': ts1, 'col_2': ts2}
d

# Uncomment and run after running previous lines
# df_1 = pd.DataFrame(data=d)
# df_1

# Uncomment and run after running previous lines
# df_2 = pd.DataFrame(np.random.randn(3, 2), columns=['col_1', 'col_2'])
# df_2

# Uncomment and run after running previous lines
# df_all = pd.concat((df_1, df_2), axis=0, ignore_index=True)
# df_all

# Uncomment and run after running previous lines
# print(df_1.shape)
# print(df_2.shape)
# print(df_all.shape)

# Uncomment and run after running previous lines
# print(df_1.shape)
# print(df_2.shape)
# print(df_all.shape)

# Uncomment and run after running previous lines
# print(df_train.shape)
# print(df_test.shape)
# print(df_all.shape)

{'col_1': [1, 2, 3, 4], 'col_2': [6, 7, 8, 9]}

In [ ]:
df_1 = pd.DataFrame(data=d)
df_1

   col_1  col_2
0      1      6
1      2      7
2      3      8
3      4      9

In [ ]:
df_2 = pd.DataFrame(np.random.randn(3, 2), columns=['col_1', 'col_2'])
df_2

      col_1     col_2
0 -1.032193  0.192051
1 -0.602140 -0.074924
2 -0.410027  1.688486

In [ ]:
df_all = pd.concat((df_1, df_2), axis=0, ignore_index=True)
df_all

      col_1     col_2
0  1.000000  6.000000
1  2.000000  7.000000
2  3.000000  8.000000
3  4.000000  9.000000
4 -1.032193  0.192051
5 -0.602140 -0.074924
6 -0.410027  1.688486

In [ ]:
print(df_1.shape)
print(df_2.shape)
print(df_all.shape)

(4, 2)
(3, 2)
(7, 2)

In [ ]:
print(df_train.shape)
print(df_test.shape)
print(df_all.shape)

NameError: ignored

In [ ]:
# Example 4
# Grouping by a Dataframe and iterating over grouped series
# 
classes = ["class 1"] * 5 + ["class 2"] * 5
sub_class = ['c1','c2','c2','c1','c3'] + ['c1','c2','c3','c2','c3']
vals = [1,3,5,1,3] + [2,6,7,5,2]
p_df = pd.DataFrame({"class": classes, "sub_class": sub_class, "vals": vals})
p_df

# Uncomment and run after running previous lines
# grouped = p_df.groupby(['class', 'sub_class'])['vals'].median()
# grouped

# Uncomment and run after running previous lines
# for index_val, value in grouped.iteritems():
#     class_name, sub_class_name = index_val
#     print(class_name, ":", sub_class_name, ":", value)

     class sub_class  vals
0  class 1        c1     1
1  class 1        c2     3
2  class 1        c2     5
3  class 1        c1     1
4  class 1        c3     3
5  class 2        c1     2
6  class 2        c2     6
7  class 2        c3     7
8  class 2        c2     5
9  class 2        c3     2

In [ ]:
grouped = p_df.groupby(['class', 'sub_class'])['vals'].median()
grouped

class    sub_class
class 1  c1           1.0
         c2           4.0
         c3           3.0
class 2  c1           2.0
         c2           5.5
         c3           4.5
Name: vals, dtype: float64

In [ ]:
grouped = p_df.groupby([ 'sub_class' , 'class'])['vals'].median()
grouped

sub_class  class
c1         class 1    1.0
           class 2    2.0
c2         class 1    4.0
           class 2    5.5
c3         class 1    3.0
           class 2    4.5
Name: vals, dtype: float64

In [ ]:
grouped2 = p_df.drop('class' , axis = 1)
grouped2

  sub_class  vals
0        c1     1
1        c2     3
2        c2     5
3        c1     1
4        c3     3
5        c1     2
6        c2     6
7        c3     7
8        c2     5
9        c3     2

In [ ]:
for index_val, value in grouped2.iteritems():
  print(class_name, ":", sub_class_name, ":", value)

class 2 : c3 : 0    c1
1    c2
2    c2
3    c1
4    c3
5    c1
6    c2
7    c3
8    c2
9    c3
Name: sub_class, dtype: object
class 2 : c3 : 0    1
1    3
2    5
3    1
4    3
5    2
6    6
7    7
8    5
9    2
Name: vals, dtype: int64

In [ ]:
for index_val, value in grouped.iteritems():
  #class_name, sub_class_name = index_val
  #print(class_name, ":", sub_class_name, ":", value)
  print(index_val)

('class 1', 'c1')
('class 1', 'c2')
('class 1', 'c3')
('class 2', 'c1')
('class 2', 'c2')
('class 2', 'c3')

In [ ]:
for index_val, value in grouped.iteritems():
  class_name, sub_class_name = index_val
  print(class_name, ":", sub_class_name, ":", value)

class 1 : c1 : 1.0
class 1 : c2 : 4.0
class 1 : c3 : 3.0
class 2 : c1 : 2.0
class 2 : c2 : 5.5
class 2 : c3 : 4.5

### <font color="green">1.3 Challenges</font>

In [ ]:
# Challenge 1
# Create the Dataframes from the given Dictionaries below and then merge them 
#
dt1 = {
        'subject_id': ['1', '2', '3', '4', '5'],
        'first_name': ['Fridah', 'Kwasi', 'Victor', 'Alice', 'Audrey'], 
        'last_name': ['Njeri', 'Adi Dako', 'Oliech', 'Tergat', 'Cheng']}

dt2 = {
        'subject_id': ['4', '5', '6', '7', '8'],
        'first_name': ['Michael', 'Judy', 'Lenny', 'Mohammed', 'Betty'], 
        'last_name': ['Macharia', 'Waithera', 'Baraza', 'Ali', 'Kyalo']}

#OUR CODE GOES HERE

df_11 = pd.DataFrame(dt1)
df_11

  subject_id first_name last_name
0          1     Fridah     Njeri
1          2      Kwasi  Adi Dako
2          3     Victor    Oliech
3          4      Alice    Tergat
4          5     Audrey     Cheng

In [ ]:
df_22 = pd.DataFrame(dt2)
df_22

  subject_id first_name last_name
0          4    Michael  Macharia
1          5       Judy  Waithera
2          6      Lenny    Baraza
3          7   Mohammed       Ali
4          8      Betty     Kyalo

In [ ]:
df_11.merge(df_22 , on = 'subject_id' , how='outer')

  subject_id first_name_x last_name_x first_name_y last_name_y
0          1       Fridah       Njeri          NaN         NaN
1          2        Kwasi    Adi Dako          NaN         NaN
2          3       Victor      Oliech          NaN         NaN
3          4        Alice      Tergat      Michael    Macharia
4          5       Audrey       Cheng         Judy    Waithera
5          6          NaN         NaN        Lenny      Baraza
6          7          NaN         NaN     Mohammed         Ali
7          8          NaN         NaN        Betty       Kyalo

In [ ]:
 pd.concat((df_11 , df_22) , axis=0)

  subject_id first_name last_name
0          1     Fridah     Njeri
1          2      Kwasi  Adi Dako
2          3     Victor    Oliech
3          4      Alice    Tergat
4          5     Audrey     Cheng
5          4    Michael  Macharia
6          5       Judy  Waithera
7          6      Lenny    Baraza
8          7   Mohammed       Ali
9          8      Betty     Kyalo

In [ ]:
# Challenge 2
# Using dt1 and dt2 dictionaries from Challenge 1, create another Dataframe from
# the dt3 Dictionary below. Then merge all of them along the subject_id value
# i.e. Columns from left; subject_id, first_name, last_name, test_id
dt3 = {
        'subject_id': ['1', '2', '3', '4', '5', '7', '8', '9', '10', '11'],
        'test_id': [51, 15, 15, 61, 16, 14, 15, 1, 61, 16]}

#OUR CODE GOES HERE
df_33 = pd.DataFrame(dt3)
df_33

  subject_id  test_id
0          1       51
1          2       15
2          3       15
3          4       61
4          5       16
5          7       14
6          8       15
7          9        1
8         10       61
9         11       16

In [ ]:
df_11.merge(df_22 , on = 'subject_id' , how='outer').merge(df_33 , on = 'subject_id' , how='outer')

   subject_id first_name_x last_name_x first_name_y last_name_y  test_id
0           1       Fridah       Njeri          NaN         NaN     51.0
1           2        Kwasi    Adi Dako          NaN         NaN     15.0
2           3       Victor      Oliech          NaN         NaN     15.0
3           4        Alice      Tergat      Michael    Macharia     61.0
4           5       Audrey       Cheng         Judy    Waithera     16.0
5           6          NaN         NaN        Lenny      Baraza      NaN
6           7          NaN         NaN     Mohammed         Ali     14.0
7           8          NaN         NaN        Betty       Kyalo     15.0
8           9          NaN         NaN          NaN         NaN      1.0
9          10          NaN         NaN          NaN         NaN     61.0
10         11          NaN         NaN          NaN         NaN     16.0

In [ ]:
# Challenge 3
# Create dataframes using dt1 and dt2 from Challenge 1 then merge based on indexes
#OUR CODE GOES HERE
df_dt1 = pd.DataFrame(dt1)
df_dt2 = pd.DataFrame(dt2)

In [ ]:
df_dt1

  subject_id first_name last_name
0          1     Fridah     Njeri
1          2      Kwasi  Adi Dako
2          3     Victor    Oliech
3          4      Alice    Tergat
4          5     Audrey     Cheng

In [ ]:
df_dt2

  subject_id first_name last_name
0          4    Michael  Macharia
1          5       Judy  Waithera
2          6      Lenny    Baraza
3          7   Mohammed       Ali
4          8      Betty     Kyalo

In [ ]:
df_dt1.merge(df_dt2 , left_index=True , right_index=True )

  subject_id_x first_name_x last_name_x subject_id_y first_name_y last_name_y
0            1       Fridah       Njeri            4      Michael    Macharia
1            2        Kwasi    Adi Dako            5         Judy    Waithera
2            3       Victor      Oliech            6        Lenny      Baraza
3            4        Alice      Tergat            7     Mohammed         Ali
4            5       Audrey       Cheng            8        Betty       Kyalo

In [ ]:
# Challenge 4
# Create a dataframe from the following url (http://bit.ly/MDSTelecomData), then 
# and determine the sum of the durations per month of calls, sms and data entries.
# Hint: Use groupby i.e. month, duration
#OUR CODE GOES HERE

df_url_MDS = "http://bit.ly/MDSTelecomData"
df_MDS = pd.read_csv(df_url_MDS)
df_MDS

     index            date  duration  item    month   network network_type
0        0  15/10/14 06:58    34.429  data  2014-11      data         data
1        1  15/10/14 06:58    13.000  call  2014-11  Vodafone       mobile
2        2  15/10/14 14:46    23.000  call  2014-11    Meteor       mobile
3        3  15/10/14 14:48     4.000  call  2014-11     Tesco       mobile
4        4  15/10/14 17:27     4.000  call  2014-11     Tesco       mobile
..     ...             ...       ...   ...      ...       ...          ...
825    825  13/03/15 00:38     1.000   sms  2015-03     world        world
826    826  13/03/15 00:39     1.000   sms  2015-03  Vodafone       mobile
827    827  13/03/15 06:58    34.429  data  2015-03      data         data
828    828  14/03/15 00:13     1.000   sms  2015-03     world        world
829    829  14/03/15 00:16     1.000   sms  2015-03     world        world

[830 rows x 7 columns]

In [ ]:
df_MDS.groupby(['duration' , 'month']).mean()

                       index
duration month
1.0      2014-11  132.494737
         2014-12  300.229167
         2015-01  494.139535
         2015-02  666.050000
         2015-03  788.000000
...                      ...
1863.0   2015-02  648.000000
1940.0   2014-11   59.000000
2120.0   2014-12  252.000000
2328.0   2015-03  742.000000
10528.0  2015-03  816.000000

[324 rows x 1 columns]

## 1.4 Converting Columns

In [ ]:
# Example 1
# 
# Converting categorical columns to integer columns using label encoding method
# so as to prepare to use categorical data in analysis. 
# For this example, we'll use a new Python library called sklearn(sci-kit learn). 
#Sklearn is machine learning library for python that is used in data mining and data anlysis. 
# As we progress in our data science journey we'll learn more about it's capabilities. 
#You will use this throughout module 1 and 2 of core as well, and in many future projects.
# From this library we are importing a method called LabelEncoder that will help us in converting categorical data into integers
from sklearn.preprocessing import LabelEncoder
label_encoder = LabelEncoder()

# Scenario 1
df = pd.DataFrame({'col_1': [1, 0, 1, 2], 
                   'col_2': [1.2, 3.1, 4.4, 5.5], 
                   'col_3': [1, 2, 3, 4], 
                   'col_4': ['a', 'b', 'c', 'd']})
df
# Some of the models that you will learn about in the future only deal with numbers, particularly integers
# First, we will convert col_4 to be in integer column, and the value within it to be integers as well.
# df.info()

# This will study the column, figure out the unique categories, and assign an integer value to each starting from 0
# This is internal to the label_encoder, it doesn't change the dataframe yet
# label_encoder.fit(df['col_4'])

# View the labels in the column
# list(label_encoder.classes_)

# This is how you transform the categories into intergers
# df['col_4'] = label_encoder.transform(df['col_4'])

# df
# df.info()

# Uncomment after running previous lines
# Slightly different scenario: repeated categories : ['a', 'b', 'b', 'a']. In this scenario, we will have duplicates in our categories
# df2 = pd.DataFrame({'col_1': [1, 0, 1, 2], 
#                    'col_2': [1.2, 3.1, 4.4, 5.5], 
#                    'col_3': [1, 2, 3, 4], 
#                    'col_4': ['a', 'b', 'b', 'a']})
# df2

# # Fitting the label encoder method in the column
# label_encoder.fit(df2['col_4'])

# # Converting the categories into integers
# df2['col_4'] = label_encoder.transform(df2['col_4'])
# # view the dataframe with the converted column
# df2
# df2.info()

   col_1  col_2  col_3 col_4
0      1    1.2      1     a
1      0    3.1      2     b
2      1    4.4      3     c
3      2    5.5      4     d

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col_1   4 non-null      int64
 1   col_2   4 non-null      float64
 2   col_3   4 non-null      int64
 3   col_4   4 non-null      object
dtypes: float64(1), int64(2), object(1)
memory usage: 256.0+ bytes

In [ ]:
label_encoder.fit(df['col_4'])

LabelEncoder()

In [ ]:
list(label_encoder.classes_)

['a', 'b', 'c', 'd']

In [ ]:
df['col_4'] = label_encoder.transform(df['col_4'])

In [ ]:
df
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col_1   4 non-null      int64
 1   col_2   4 non-null      float64
 2   col_3   4 non-null      int64
 3   col_4   4 non-null      int64
dtypes: float64(1), int64(3)
memory usage: 256.0 bytes

In [ ]:
# Example 2
# Reducing high dimensionality from categorical column
# We will learn more about the topic of Dimension reduction in Core
# More info: 
# 1) http://bit.ly/DimensionReductionExample
# 2) http://bit.ly/DimensionReductionProblem
#
df = pd.DataFrame({'groups': ['group 1','group 2','group 1','group 2','group 3','group 4','group 5','group 1','group 2','group 5'], 
                   'vals': [1,2,3,4,5,6,7,8,9,10]})
df

# Uncomment after running previous lines
# df['groups'].value_counts()

# Uncomment after running previous lines
# high_dim_columns = ['groups']

# Uncomment after running previous lines
# for column in high_dim_columns:
#    a = pd.DataFrame(df[column].value_counts() <= 2)
#    unique_values = a.index[a[column]].values
#    df.loc[df[column].isin(unique_values), column] = 'other'
# df

In [ ]:
# Example 3
# Converting categorical column to one hot encoded column 
# More information on hot encoding: http://bit.ly/HotEncoding
# 
df = pd.DataFrame({'sex': ['M', 'F', 'M', 'F'], 
                   'col_2': [1.2, 3.1, 4.4, 5.5], 
                   'col_3': [1, 2, 3, 4], 
                   'col_4': ['a', 'b', 'c', 'd']})
df

# Uncomment after running previous lines
# categorical_variables = ['sex']

# Uncomment after running previous lines
# for variable in categorical_variables:
#    df[variable].fillna("Missing", inplace=True) # Fill missing data with the word "Missing"
#    dummies = pd.get_dummies(df[variable], prefix=variable) # Create array of dummies
#    df = pd.concat([df, dummies], axis=1) # Update dataframe to include dummies and drop the main variable
#    df.drop([variable], axis=1, inplace=True) 
# df

### <font color="green">1.4 Challenges</font>

In [ ]:
# Challenge 1
# Create a dataframe from the given dictionary below then
# Convert the categorical column to an integer column
# 
dt1 = {'patient': [1, 1, 1, 2, 2], 
        'obs': [1, 2, 3, 1, 2], 
        'diagnosis': [0, 1, 0, 1, 0],
        'score': ['weak', 'strong', 'normal', 'weak', 'normal']}

#OUR CODE GOES HERE

In [ ]:
# Challenge 2
# Convert the categorical column to one hot encoded column
# in the following list
# 
list1 = [["Nairobi", "range", 3000], ["Mombasa", "tuktuk", 4000], ["Nakuru", "tuktuk", 1000]]

OUR CODE GOES HERE

## 1.5 Splitting Columns

In [2]:
# Example 1
# Splitting a column using a delimiter
# 
import pandas as pd

data = [{'test': 'vikash|Arpit', 'val': 6},
        {'test': 'vikash_1|arpit|Vinayp', 'val': 3},
        {'test': 'arpit|vinayp', 'val': 2}]
df = pd.DataFrame.from_dict(data, orient='columns')
df

# Uncomment after running previous lines
#df['test'].apply(lambda x: pd.Series([i for i in reversed(x.lower().split('|'))]))

                    test  val
0           vikash|Arpit    6
1  vikash_1|arpit|Vinayp    3
2           arpit|vinayp    2

In [3]:
df['test'].apply(lambda x: pd.Series([i for i in reversed(x.lower().split('|'))]))

        0       1         2
0   arpit  vikash       NaN
1  vinayp   arpit  vikash_1
2  vinayp   arpit       NaN

In [4]:
# Example 2
# Splitting a column using delimiter and one hot encode the values 
# 
data = [{'test': 'vikash|Arpit', 'val': 6},
        {'test': 'vikash_1|arpit|Vinayp', 'val': 3},
        {'test': 'arpit|vinayp', 'val': 2}]

df = pd.DataFrame.from_dict(data, orient='columns')
df

# Uncomment after running previous lines
# chosen_columns = set()
# for idx, row in df.iterrows():
#     for val in str(row['test']).lower().split('|'):
#         chosen_columns.add(val.strip())

# Uncomment after running previous lines
# chosen_columns_list = list(chosen_columns)

# Uncomment after running previous lines
# chosen_columns_list.sort(key=len, reverse=True) 
# chosen_columns_list


# def get_one_hot_encoded_column(col_value):
#     col_value = col_value.lower()
#     new_col_value = ''
#     for val in chosen_columns_list:
#         if val in col_value.split('|'):
#             col_value = col_value.replace(val, '')
#             new_col_value += '1,'
#         else:
#             new_col_value += '0,'
#     return new_col_value[:-1]

# Uncomment after running previous lines
# df['test_new'] = df['test'].map(get_one_hot_encoded_column)
# df

# Uncomment after running previous lines
# df2 = df['test_new'].apply(lambda x: pd.Series([i for i in x.lower().split(',')]))
# df2

# Uncomment after running previous lines
# df2.columns = chosen_columns_list
# df2

# Uncomment after running previous lines
# df2.info()

# Uncomment after running previous lines
# df2 = df2.apply(pd.to_numeric)

# Uncomment after running previous lines
# df2.info()

# Uncomment after running previous lines
# df_new = pd.concat([df, df2], axis=1)

# Uncomment after running previous lines
# df_new.drop(['test', 'test_new'], inplace=True, axis=1)
# df_new

                    test  val
0           vikash|Arpit    6
1  vikash_1|arpit|Vinayp    3
2           arpit|vinayp    2

In [5]:
chosen_columns = set()
for idx, row in df.iterrows():
  for val in str(row['test']).lower().split('|'):
    chosen_columns.add(val.strip())

In [11]:
chosen_columns_list = list(chosen_columns)
chosen_columns_list

['arpit', 'vikash_1', 'vikash', 'vinayp']

In [12]:
chosen_columns_list.sort(key=len, reverse=True) 
chosen_columns_list

['vikash_1', 'vikash', 'vinayp', 'arpit']

In [20]:
def get_one_hot_encoded_column(col_value):
  col_value = col_value.lower()
  new_col_value = ''
  for val in chosen_columns_list:
    if val in col_value.split('|'):
      col_value = col_value.replace(val, '')
      new_col_value += '1,'
    else:
      new_col_value += '0,'
  return new_col_value[:-1]

In [22]:
df['test_new'] = df['test'].map(get_one_hot_encoded_column)
df

                    test  val test_new
0           vikash|Arpit    6  0,1,0,1
1  vikash_1|arpit|Vinayp    3  1,0,1,1
2           arpit|vinayp    2  0,0,1,1

In [23]:
df2 = df['test_new'].apply(lambda x: pd.Series([i for i in x.lower().split(',')]))
df2

   0  1  2  3
0  0  1  0  1
1  1  0  1  1
2  0  0  1  1

In [24]:
df2.columns = chosen_columns_list
df2

  vikash_1 vikash vinayp arpit
0        0      1      0     1
1        1      0      1     1
2        0      0      1     1

In [25]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   vikash_1  3 non-null      object
 1   vikash    3 non-null      object
 2   vinayp    3 non-null      object
 3   arpit     3 non-null      object
dtypes: object(4)
memory usage: 224.0+ bytes

In [26]:
df2 = df2.apply(pd.to_numeric)
df2

   vikash_1  vikash  vinayp  arpit
0         0       1       0      1
1         1       0       1      1
2         0       0       1      1

In [27]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   vikash_1  3 non-null      int64
 1   vikash    3 non-null      int64
 2   vinayp    3 non-null      int64
 3   arpit     3 non-null      int64
dtypes: int64(4)
memory usage: 224.0 bytes

In [29]:
df_new = pd.concat([df, df2], axis=1)
df_new

                    test  val test_new  vikash_1  vikash  vinayp  arpit
0           vikash|Arpit    6  0,1,0,1         0       1       0      1
1  vikash_1|arpit|Vinayp    3  1,0,1,1         1       0       1      1
2           arpit|vinayp    2  0,0,1,1         0       0       1      1

In [30]:
df_new.drop(['test', 'test_new'], inplace=True, axis=1)
df_new

   val  vikash_1  vikash  vinayp  arpit
0    6         0       1       0      1
1    3         1       0       1      1
2    2         0       0       1      1

### <font color="green">1.5 Challenges</font>

In [33]:
# Challenge 1
# Split the following dataframe into multiple rows
#
df_towns = pd.DataFrame({
   'EmployeeId': ['123', '124', '125', '126', '126'],
   'City': ['Nairobi|Mombasa', 'Nakuru|Nairobi|Kisumu', 'Nairobi|Mombasa', 'Nairobi|Nakuru', 'Mombasa'] 
})

#OUR CODE GOES HERE
df_towns

  EmployeeId                   City
0        123        Nairobi|Mombasa
1        124  Nakuru|Nairobi|Kisumu
2        125        Nairobi|Mombasa
3        126         Nairobi|Nakuru
4        126                Mombasa

In [42]:
chosen_columns_towns = set()
for idx , row in df_towns.iterrows():
  for val in str(row['City']).lower().split('|'):
    chosen_columns_towns.add(val.strip())

print(chosen_columns_towns)

{'mombasa', 'nakuru', 'kisumu', 'nairobi'}

In [43]:
chosen_columns_towns_list = list(chosen_columns_towns)
chosen_columns_towns_list

['mombasa', 'nakuru', 'kisumu', 'nairobi']

In [44]:
chosen_columns_towns_list.sort(key=len , reverse=True)
chosen_columns_towns_list

['mombasa', 'nairobi', 'nakuru', 'kisumu']

In [48]:
def get_one_hot_encoded_column_towns(col_value):
  col_value = col_value.lower()
  new_col_value = ''
  for val in chosen_columns_towns_list:
    if val in col_value.split('|'):
      col_value = col_value.replace(val , '')
      new_col_value += '1,'
    else:
      new_col_value += '0,'
  return new_col_value[:-1]

In [51]:
df_towns['City_New'] = df_towns['City'].map(get_one_hot_encoded_column_towns)
df_towns

  EmployeeId                   City City_New
0        123        Nairobi|Mombasa  1,1,0,0
1        124  Nakuru|Nairobi|Kisumu  0,1,1,1
2        125        Nairobi|Mombasa  1,1,0,0
3        126         Nairobi|Nakuru  0,1,1,0
4        126                Mombasa  1,0,0,0

In [ ]:
# Challenge 2
# Split the following dataframe 
# 

list_1 = [1,2,3,4,5]
list_2 = [2,4,6,8,10]
list_3 = ['one','two,three,four','three,four,five','four,five','five']

df = pd.DataFrame({'A' : list_1, 'B' : list_2, 'C' : list_3})

OUR CODE GOES HERE